[{
  "module number": "1",
  "name": "Launching Into Computer Science",
  "type": "Core",
  "description": "The module will explore and investigate the fundamental theories and practices of computing and then gradually explore the trends and current developments in the field of computer science. The module presents the historical, architectural and practical perspectives of computer science discipline, also enable the learners to get engage, experience and envision the current as well as the future development of the discipline. The module is designed not only to equip the students with fundamental theoretical and practical skills, but also to make the learners aware of the ethical and professional responsibilities. The module enables the learners to engage in debate to identify contemporary computer technology-based challenges, i.e. global impacts, security and threats."
},
  {
    "module number": "2",
    "name": "Object-oriented Information Systems",
    "type": "Non-core",
    "description": "In this module, students will contextualise and develop information systems using object-oriented approaches with various programming languages, such as Python and SQL. This involves equipping students with the practical skills required to be able to analyse an information system problem, design and implement a solution using various industry standard tools and techniques."
  },
  {
    "module number": "3",
    "name": "Secure Software Development (Computer Science)",
    "type": "Non-core",
    "description": "This module introduces students to the underpinning concepts and skills of Secure Software Development. This includes a review of traditional and contemporary Software Development LifeCycle (SDLC)models, focusing in particular on the areas most affected by secure coding considerations. The course will provide students with a combination of an understanding of security principles together with exposure to automated testing tools. Students will be introduced to the techniques in an engaging format, using a mixture of practical exercises, group work and individual activities."
  },
  {
    "module number": "4",
    "name": "Network and Information Security Management",
    "type": "Non-core",
    "description": "This module introduces students to the underpinning concepts of Computer Networks and the skills of Information Security Management. This includes an introduction to network security fundamentals and information security governance principles. It will be based on mapping information security management roles onto a number of security models. The module describes the security management and protection issues involving business resources, risks, monitoring as well as business continuity strategies. It will also discuss common diagnostic and monitoring tools utilised as part of a Network and Information Security practice such as nessus, snort, syslog and ELK. Students will be introduced to the techniques in an engaging format, using a mixture of group work and individual activities"
  },
  {
    "module number": "5",
    "name": "Software Engineering Project Management",
    "type": "Non-core",
    "description": "This module introduces students to the underpinning concepts and skills of Software Engineering Project Management, as well as introducing concepts of Behaviour Driven Development (BDD). This includes both the traditional tools of project management including estimating, planning and scheduling, as well as those of software architecture and engineering disciplines. The module describes requirements management, SDLC approaches, including continuous integration and continuous delivery (CI/CD), as well as tools often delivered as part of the Agile methodology. Students will be introduced to the techniques in an engaging format, using a mixture of group work and individual activities."
  },
  {
    "module number": "6",
    "name": "Research Methods and Professional Practice",
    "type": "Core",
    "description": "This module provides a practical foundation in research methods that enables students to conduct research in practical settings. The approach covers various tools and techniques that a researcher may deploy and facilitates continual feedback throughout the module through cases and project tasks. The selected textbook offers a comprehensive redress of the subject, based around the scientific method and offering much details for doing research in various type of organisations. Students will be able to identify with research practicalities no matter their background, as well as use critical analysis of the key principles of research methodology in bringing together the knowledge gained throughout other modules on the programme. The module will also highlight professional, legal, social, cultural and ethical issues related to computing projects, as well as the applicable codes of ethics and practice. The module uses continuous assessment throughout with weekly case studies and milestone assessments, hence facilitating peerto-peer as well as instructor interactions. Students will demonstrate their ability and strengths through evidence and reflections by maintaining an e-portfolio."
  },
  {
    "module number": "7",
    "name": "MSc Computing Project and Dissertation",
    "type": "Core",
    "description": "This module provides students with a systematic method for planning, executing, writing, and defending a dissertation for a research project on a selected topic of interest. The student will undertake a substantive piece of independent work designed to demonstrate her/his ability to manage the learning process and achieve successful milestones and targets. Emphasis will be on developing skills in planning, writing, ethics, investigation, interpretation, evaluation, and critical thinking. The project’s topic will be agreed with a designated dissertation supervisor prior to commencement to ensure feasibility within the timeframe of the module. It should be noted that the topic of the literature review produced during the Research Methods and Professional Issues module, cannot be used in this Dissertation and Project module. This must be a separate project."
  }
]